## Production: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 9 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                   NAME                                   |
|----------|--------------------------------------------------------------------------|
| delete   | `module.notify_slack.aws_cloudwatch_log_group.notify_slack_lambda`       |
|          | `module.notify_slack.aws_iam_policy.notify_slack_lambda`                 |
|          | `module.notify_slack.aws_iam_role.notify_slack_lambda`                   |
|          | `module.notify_slack.aws_iam_role_policy_attachment.notify_slack_lambda` |
|          | `module.notify_slack.aws_lambda_function.notify_slack`                   |
|          | `module.notify_slack.aws_lambda_permission.notify_slack[0]`              |
|          | `module.notify_slack.aws_lambda_permission.notify_slack[1]`              |
| update   | `aws_cloudwatch_log_metric_filter.wordpress_errors`                      |
| recreate | `aws_sns_topic_subscription.alert_warning`                               |
|          | `aws_sns_topic_subscription.alert_warning_us_east`                       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.wordpress_errors will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "wordpress_errors" {
        id             = "WordPressErrors"
        name           = "WordPressErrors"
      ~ pattern        = "[(w1=\"*Failed*\" || w1=\"*failed*\" || w1=\"*Error*\" || w1=\"*error*\" || w1=\"*Fatal*\" || w1=\"*fatal*\") && w1!=\"*AH01276*\" && w1!=\"*AH01630*\" && w1!=\"*action=lostpassword&error*\" && w1!=\"*GET /notification-gc-notify/wp-json/wp/v2/pages*\"]" -> "[(w1=\"*Failed*\" || w1=\"*failed*\" || w1=\"*Error*\" || w1=\"*error*\" || w1=\"*Fatal*\" || w1=\"*fatal*\") && w1!=\"*AH01276*\" && w1!=\"*AH01630*\" && w1!=\"*action=lostpassword&error*\" && w1!=\"*GET /notification-gc-notify/wp-json/wp/v2/pages*\" && w1!=\"*HTTP/1.1\\\" 404*\"]"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_sns_topic_subscription.alert_warning must be replaced
-/+ resource "aws_sns_topic_subscription" "alert_warning" {
      ~ arn                             = "arn:aws:sns:ca-central-1:472286471787:alert-warning:57fd272e-0126-400b-8702-52aeb44b665e" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ endpoint                        = (sensitive value) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:ca-central-1:472286471787:alert-warning:57fd272e-0126-400b-8702-52aeb44b665e" -> (known after apply)
      ~ owner_id                        = "472286471787" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ protocol                        = "lambda" -> "https" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.alert_warning_us_east must be replaced
-/+ resource "aws_sns_topic_subscription" "alert_warning_us_east" {
      ~ arn                             = "arn:aws:sns:us-east-1:472286471787:alert-warning:3cdc2068-08ad-4fb9-bebc-b7a033392f58" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ endpoint                        = (sensitive value) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:472286471787:alert-warning:3cdc2068-08ad-4fb9-bebc-b7a033392f58" -> (known after apply)
      ~ owner_id                        = "472286471787" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ protocol                        = "lambda" -> "https" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.notify_slack.aws_cloudwatch_log_group.notify_slack_lambda will be destroyed
  # (because aws_cloudwatch_log_group.notify_slack_lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "notify_slack_lambda" {
      - arn               = "arn:aws:logs:ca-central-1:472286471787:log-group:/aws/lambda/notify_slack" -> null
      - id                = "/aws/lambda/notify_slack" -> null
      - name              = "/aws/lambda/notify_slack" -> null
      - retention_in_days = 14 -> null
      - tags              = {
          - "CostCentre" = "PlatformGCArticles"
        } -> null
      - tags_all          = {
          - "CostCentre" = "PlatformGCArticles"
        } -> null
    }

  # module.notify_slack.aws_iam_policy.notify_slack_lambda will be destroyed
  # (because aws_iam_policy.notify_slack_lambda is not in configuration)
  - resource "aws_iam_policy" "notify_slack_lambda" {
      - arn       = "arn:aws:iam::472286471787:policy/NotifySlackLambda-notify_slack" -> null
      - id        = "arn:aws:iam::472286471787:policy/NotifySlackLambda-notify_slack" -> null
      - name      = "NotifySlackLambda-notify_slack" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:472286471787:log-group:/aws/lambda/notify_slack"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPAW35TXUZV5LKMPQDFJ" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.notify_slack.aws_iam_role.notify_slack_lambda will be destroyed
  # (because aws_iam_role.notify_slack_lambda is not in configuration)
  - resource "aws_iam_role" "notify_slack_lambda" {
      - arn                   = "arn:aws:iam::472286471787:role/NotifySlackLambda-notify_slack" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-12-17T15:12:48Z" -> null
      - force_detach_policies = false -> null
      - id                    = "NotifySlackLambda-notify_slack" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::472286471787:policy/NotifySlackLambda-notify_slack",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "NotifySlackLambda-notify_slack" -> null
      - path                  = "/" -> null
      - role_last_used        = [
          - {
              - last_used_date = "2023-07-22T07:22:57Z"
              - region         = "ca-central-1"
            },
        ] -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAW35TXUZVXKJ3VR26C" -> null

      - inline_policy {}
    }

  # module.notify_slack.aws_iam_role_policy_attachment.notify_slack_lambda will be destroyed
  # (because aws_iam_role_policy_attachment.notify_slack_lambda is not in configuration)
  - resource "aws_iam_role_policy_attachment" "notify_slack_lambda" {
      - id         = "NotifySlackLambda-notify_slack-20211217151250929200000002" -> null
      - policy_arn = "arn:aws:iam::472286471787:policy/NotifySlackLambda-notify_slack" -> null
      - role       = "NotifySlackLambda-notify_slack" -> null
    }

  # module.notify_slack.aws_lambda_function.notify_slack will be destroyed
  # (because aws_lambda_function.notify_slack is not in configuration)
  - resource "aws_lambda_function" "notify_slack" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ca-central-1:472286471787:function:notify_slack" -> null
      - description                    = "Lambda function to post CloudWatch alarm notifications to a Slack channel." -> null
      - filename                       = "/tmp/notify_slack.py.zip" -> null
      - function_name                  = "notify_slack" -> null
      - handler                        = "notify_slack.lambda_handler" -> null
      - id                             = "notify_slack" -> null
      - invoke_arn                     = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:472286471787:function:notify_slack/invocations" -> null
      - last_modified                  = "2023-06-30T14:20:52.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ca-central-1:472286471787:function:notify_slack:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:472286471787:function:notify_slack:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::472286471787:role/NotifySlackLambda-notify_slack" -> null
      - runtime                        = "python3.8" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "iC0Ta5b8fs9u6i/c3LA3/Tk8BUHfS6Jgq4NF8At0CBo=" -> null
      - source_code_size               = 1613 -> null
      - tags                           = {
          - "CostCentre" = "PlatformGCArticles"
        } -> null
      - tags_all                       = {
          - "CostCentre" = "PlatformGCArticles"
        } -> null
      - timeout                        = 30 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "LOG_EVENTS"        = "True"
              - "PROJECT_NAME"      = "Articles: production"
              - "SLACK_WEBHOOK_URL" = (sensitive value)
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.notify_slack.aws_lambda_permission.notify_slack[0] will be destroyed
  # (because aws_lambda_permission.notify_slack is not in configuration)
  - resource "aws_lambda_permission" "notify_slack" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "notify_slack" -> null
      - id            = "AllowExecutionFromSNS-notify_slack-0" -> null
      - principal     = "sns.amazonaws.com" -> null
      - source_arn    = "arn:aws:sns:ca-central-1:472286471787:alert-warning" -> null
      - statement_id  = "AllowExecutionFromSNS-notify_slack-0" -> null
    }

  # module.notify_slack.aws_lambda_permission.notify_slack[1] will be destroyed
  # (because aws_lambda_permission.notify_slack is not in configuration)
  - resource "aws_lambda_permission" "notify_slack" {
      - action        = "lambda:InvokeFunction" -> null
      - function_name = "notify_slack" -> null
      - id            = "AllowExecutionFromSNS-notify_slack-1" -> null
      - principal     = "sns.amazonaws.com" -> null
      - source_arn    = "arn:aws:sns:us-east-1:472286471787:alert-warning" -> null
      - statement_id  = "AllowExecutionFromSNS-notify_slack-1" -> null
    }

Plan: 2 to add, 1 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_target_4xx_response"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_target_response_time_average"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_target_unhealthy_host"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cloudfront_4xx_response"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cloudfront_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ecs_cpu_utilization"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ecs_memory_utilization"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_aurora_replica_lag"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_cpu_utilization_reader"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_cpu_utilization_writer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_freeable_memory_reader"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.rds_freeable_memory_writer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_ecs_warn_error_event"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_errors"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_failed_login"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.wordpress_warnings"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.sns_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.sns_cloudwatch_us_east"]
WARN...
```

</details>
